Enums/НаименованиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>НаименованиеНастройки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресПринтера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаНаВнешнийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмяПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладМасло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресСервераПечати</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/глДоступ/Ext/Module.bsl
&НаСервере
Функция ПолучитьНаименованиеНастройкиПоСтроке(Имя) Экспорт
	
	Если ТипЗнч(Имя) <> Тип("Строка") Тогда
		Возврат имя;
	КонецЕСЛИ;
	
	Попытка
		Возврат Перечисления.НаименованиеНастройки[Имя];	
	Исключение
		Сообщить("Настройка "+Имя+" не найдена");
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ОбновитьПараметрыСеанса() экспорт

	ОбновитьЗаписиРегНастройки();
	
	ПараметрыСеанса.АдресПринтера = ПолучитьАдресПринтера();
	
	Если СокрЛП(Константы.ИдУстройства.Получить())="" ТОгда
		Константы.ИдУстройства.Установить(Новый УникальныйИдентификатор());
	КонецЕСЛИ;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписиРегНастройки()
	
	Если ЗначениеЗаполнено(глДоступ.ПолучитьОсновнойСклад())=Ложь Тогда
		глДоступ.УстановитьОсновнойСклад(Константы.Склад.Получить());
	КонецЕсли;
	
	//Переход  со строкового типа на перечисление
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемы.ИмяНастройки КАК Имя,
	               |	НастройкиСистемы.Зн КАК Зн
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы
				   //|LEFT OUTER JOIN Перечисление.НаименованиеНастройки Пер ON Пер.ссылка = ИмяНастройки
				   //|WHERE Пер.ссылка IS NULL
				   |INNER JOIN Перечисление.НаименованиеНастройки Пер ON Пер.ссылка = ИмяНастройки
				   |
				   |";
	Тбл = Запрос.Выполнить().Выгрузить();
	Если Тбл.Количество() = 0 ТОгда Возврат; КонецеСЛИ;
	
	Наб = РегистрыСведений.НастройкиСистемы.СоздатьНаборЗаписей();
	Мас = Новый Массив;
	
	Для каждого Стр из ТБл Цикл
		Если ЗначениеЗаполнено(Стр.Зн) =Ложь Тогда Продолжить; КонецЕСЛИ;
		
		Если ТипЗнч(Стр.Имя) = Тип("Строка") ТОгда Продолжить; КонецЕсли;
		
		//имя = ПолучитьНаименованиеНастройкиПоСтроке(стр.Имя);
		Имя = XMLСтрока(Стр.Имя);
		Если Имя = Неопределено Тогда Продолжить; КонецЕСЛИ;
		Если Мас.Найти(Имя) <> Неопределено ТОгда Продолжить; КонецеслИ;
		Мас.Добавить(Имя);
		
		Зап = наб.Добавить();
		Зап.ИмяНастройки = Имя;
		Зап.Зн = Стр.зн;
		
	КонецЦикла;
	
	Наб.Записать();
	Сообщить("Настройка прав обновлена!");
	
КонецПроцедуры


#Область ПолучениеНастроек
Функция ПолучитьНАстройку(Имя,знНаВозврат = Неопределено) экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемы.Зн КАК Зн
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы
	               |ГДЕ
	               |	НастройкиСистемы.ИмяНастройки = &ИмяНастройки";
	Запрос.УстановитьПараметр("ИмяНастройки",Имя);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() ТОгда
		Возврат Выб.Зн;
	ИНАче
		УстановитьНастройку(Имя,знНаВозврат);
		Возврат знНаВозврат;
	КонецесЛИ;
	
КонецФункции

Функция ПолучитьОрганизацию() Экспорт
	 Возврат ПолучитьНастройку("Организация");
КонецФункции

Функция ПолучитьАдресСервераПечати() Экспорт
	 Возврат ПолучитьНастройку("АдресСервераПечати","");
КонецФункции

Функция ПолучитьАдресПринтера() Экспорт
	 Возврат ПолучитьНастройку("АдресПринтера","");
КонецФункции

Функция ПолучитьИмяПользователя() Экспорт
	 Возврат ПолучитьНастройку("ИмяПользователя",ИмяКомпьютера());
КонецФункции

Функция ПолучитьНаименованиеУстройства() Экспорт
	 Возврат ПолучитьНастройку("Наименование","");
КонецФункции

Функция ПолучитьОтправкаНаВнешнийАдрес() Экспорт
	 Возврат ПолучитьНастройку("ОтправкаНаВнешнийАдрес",Ложь);
КонецФункции
 
Функция ПолучитьСкладМасло() Экспорт
	 Возврат ПолучитьНастройку("СкладМасло",Справочники.Склады.ПустаяСсылка());
КонецФункции
 
Функция ПолучитьОсновнойСклад() Экспорт
	 Возврат ПолучитьНастройку("ОсновнойСклад",Справочники.Склады.ПустаяСсылка());
КонецФункции
 
Функция ПолучитьСтруктураДанныхКлиента() Экспорт
	 пЗн =  ПолучитьНастройку("СтруктураДанныхКлиента");
	 Возврат XMLЗначение(Тип("ХранилищеЗначения"),пЗн).Получить();
КонецФункции

Функция СписыватьЧерезДокумент() Экспорт
	 Возврат ПолучитьНастройку("СписыватьЧерезДокумент",Ложь);
КонецФункции

Функция ДоступНоменклатура() Экспорт
	 Возврат ПолучитьНастройку("правоНоменклатура",Ложь);
КонецФункции

Функция ДоступЗапросыНаНовуюНоменклатуру() Экспорт
	 //Возврат ПолучитьНастройку("ДоступЗапНом",Ложь);
	 Возврат Константы.ДоступЗапросыНаНовуюНоменклатуру.Получить();
КонецФункции

Функция ДоступСогласованиеВыдачиТМЦ() Экспорт
	// Возврат ПолучитьНастройку("ДоступСоглВыдТМЦ",Ложь);
	Возврат Константы.ДоступСогласованиеВыдачиТМЦ.Получить();
КонецФункции

Функция ДоступДвиженияПоСкладу() Экспорт
	Возврат Константы.ДоступДвиженияПоСкладу.Получить();
КонецФункции

Функция ДоступВыдачаТМЦнаТС() Экспорт
	Возврат Константы.ДоступВыдачаТМЦнаТС.Получить();
КонецФункции

#КонецОбласти 

#Область УстановкаНастроек
Процедура УстановитьНастройку(Имя,зн) экспорт
	
	//пИмя = ПолучитьНаименованиеНастройкиПоСтроке(Имя);
	//Если пИмя = Неопределено Тогда Возврат; КонецеСЛИ;
	Если Лев(имя,6) = "Доступ" Тогда
		Константы[Имя].установить(Зн);
	Иначе
		Зап = РегистрыСведений.НастройкиСистемы.СоздатьМенеджерЗаписи();
		Зап.ИмяНастройки = Имя;
		Зап.Зн = Зн;
		Зап.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьАдресПринтера(Зн) Экспорт
	УстановитьНАстройку("АдресПринтера",зн); 
КонецПроцедуры

Процедура УстановитьОтправкаНаВнешнийАдрес(Зн) Экспорт
	УстановитьНАстройку("ОтправкаНаВнешнийАдрес",зн); 
КонецПроцедуры

Процедура УстановитьСкладМасло(Зн) Экспорт
	УстановитьНАстройку("СкладМасло",зн); 
КонецПроцедуры

Процедура УстановитьОсновнойСклад(Зн) Экспорт
	УстановитьНАстройку("ОсновнойСклад",зн); 
КонецПроцедуры

Процедура УстановитьСтруктураДанныхКлиента(Зн) Экспорт
	УстановитьНАстройку("СтруктураДанныхКлиента",XMLстрока(Новый ХранилищеЗначения(Зн,Новый СжатиеДанных(6)))); 
КонецПроцедуры


#КонецОбласти
